# Modifying Dataframes

A Dataframe is a two-dimensional labeled data structure with heterogeneously typed columns, having both a row and a column indices.

In [1]:
import pandas as pd
pd.__version__ , pd.__path__

('1.4.2', ['/home/rida/anaconda3/lib/python3.9/site-packages/pandas'])

In [10]:
df = pd.read_csv('data.csv')
df.head()

  StudentID    Name    Group  Maths English  Urdu  Grades
0      MS01   Naima  Group A   34.0      23  23.0    49.0
1      MS09    Azka  Group C   22.0      24  24.0    23.0
2      MS02   Nimra      NaN   34.0     NAN   NaN    87.0
3      MS03    Ayla  Group A   23.0      23  25.0    75.0
4      MS04  Ayesha  Group B   12.0      26  25.0    47.0

In [11]:
df.tail()

   StudentID     Name    Group  Maths English  Urdu  Grades
24      MS29    Maria  Group C   12.0     634  27.0    76.0
25      MS24    Arosh  Group A   46.0      64  63.0    75.0
26      MS32     Beck  Group A   23.0      64  23.0    39.0
27      MS64  Qandeel  Group B   34.0      23  26.0    85.0
28      MS55  Anoosha  Group C   12.0      65  43.0    82.0

In [12]:
df.shape

(29, 7)

In [13]:
df.index

RangeIndex(start=0, stop=29, step=1)

In [14]:
df.columns

Index(['StudentID', 'Name', 'Group', 'Maths', 'English', 'Urdu', 'Grades'], dtype='object')

In [15]:
df.dtypes

StudentID     object
Name          object
Group         object
Maths        float64
English       object
Urdu         float64
Grades       float64
dtype: object

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   StudentID  29 non-null     object
 1   Name       28 non-null     object
 2   Group      28 non-null     object
 3   Maths      27 non-null     float64
 4   English    29 non-null     object
 5   Urdu       28 non-null     float64
 6   Grades     23 non-null     float64
dtypes: float64(3), object(4)
memory usage: 1.7+ KB

## 1. Add a New Column in a Dataframe
To add a new column in a dataframe, create an appropriate series and then assign it to the dataframe


Every time a new series is added to a dataframe, its name automatically becomes an attribute of that dataframe.


It can be a series created from scratch, which can be cumbersome if the dataframe has thousands of rows.


Another common way to add a column is construct a series from the existing data within the dataframe
Let us understand this with an example